from aiogram import types, Dispatcher
from bot.keyboards import get_main_menu, get_menu_link

HELP_TEXT = """    
<b>Основные функции:</b>
🪟 <b>Окна в расписании</b> - поиск свободного времени
👥 <b>Мои группы</b> - управление вашими группами

<b>Ссылки быстрого доступа:</b>
📅 Расписание - официальный бот ВятГУ с расписанием
📝 Отметка - система посещений
📌 ЛК - личный кабинет ВятГУ

<b>Как добавить группу?</b>
1. Перейти в нужный раздел
2. Ввести соответствующую команду:
- Добавление групп института
Напишите: <code>+НазваниеИнститута (Сокращенное)</code>
Например*: <code>+АТОД</code>

- Добавление групп факультета
Напишите: <code>+НазваниеФакультета (Сокращенное)</code>
Например*: <code>+БС</code> 

- Добавление групп специальности:
Напишите: <code>+НазваниеСпециальности (Сокращенное)</code>
Например*: <code>+КОТ</code>

- Добавление отдельной группы:
Напишите: <code>+НазваниеГруппы</code>
Например*: <code>+КОТб-1963-03-13</code>

<i>* - Пример взят из воздуха и не несет цели кого-либо оскорбить</i>

<b>Как удалить группу?</b>
Аналогично с добавлением, только вместо "+" следует писать "-"
"""


async def send_help(message: types.Message):
    """ Обработка ввода команды /help """
    await message.answer(HELP_TEXT, reply_markup=get_main_menu(), parse_mode='HTML')


def register_main_handlers(dp: Dispatcher):
    dp.register_message_handler(send_help, commands=["help"], state='*')
    dp.register_message_handler(send_help, text='ℹ️ Помощь', state='*')